
import { LessonDefinition } from '../types';

export const TOPICS: LessonDefinition[] = [
  { 
    id: '1.5', 
    title: 'Цели броеви', 
    db_topic: "1.5. ЦЕЛИ БРОЕВИ ПОДРЕДУВАЊЕ И СПОРЕДУВАЊЕ" 
  },
  { 
    id: '1.6', 
    title: 'Апсолутна вредност', 
    db_topic: "1.6. АПСОЛУТНА ВРЕДНОСТ" 
  },
  { 
    id: '1.7', 
    title: 'Собирање на цели броеви', 
    db_topic: "1.7. СОБИРАЊЕ НА ЦЕЛИ БРОЕВИ" 
  },
  { 
    id: '1.8', 
    title: 'Својства на собирањето', 
    db_topic: "1.8. СВОЈСТВА НА СОБИРАЊЕТО ЦЕЛИ БРОЕВИ" 
  },
  { 
    id: '1.9', 
    title: 'Одземање цели броеви', 
    db_topic: "1.9. ОДЗЕМАЊЕ ЦЕЛИ БРОЕВИ" 
  },
  { 
    id: '1.10', 
    title: 'Множење цели броеви', 
    db_topic: "1.10. МНОЖЕЊЕ ЦЕЛИ БРОЕВИ" 
  },
  { 
    id: '1.11', 
    title: 'Делење цели броеви', 
    db_topic: "1.11. ДЕЛЕЊЕ ЦЕЛИ БРОЕВИ" 
  },
  { 
    id: '1.12', 
    title: 'Вредност на броен израз', 
    db_topic: "1.12. ВРЕДНОСТ НА БРОЕН ИЗРАЗ" 
  },
  { 
    id: '1.13', 
    title: 'Степен со показател природен број', 
    db_topic: "1.13. СТЕПЕН СО ПОКАЗАТЕЛ ПРИРОДЕН БРОЈ" 
  },
  { 
    id: '1.14', 
    title: 'Квадрати и квадратни корени', 
    db_topic: "1.14. КВАДРАТИ И КВАДРАТНИ КОРЕНИ НА ПРИРОДНИ БРОЕВИ ДО 100" 
  },
  { 
    id: '1.15', 
    title: 'Подредување и споредување дропки', 
    db_topic: "1.15. ПОДРЕДУВАЊЕ И СПОРЕДУВАЊЕ ДРОПКИ" 
  },
  { 
    id: '1.16', 
    title: 'Децимални броеви', 
    db_topic: "1.16. ДЕЦИМАЛНИ БРОЕВИ, ПЕРИОДИЧНИ ДЕЦИМАЛНИ БРОЕВИ" 
  }
];
